logs/Google_cloud/select_random_points.log
sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            56272
        write:                           0
        other:                           0
        total:                           56272
    transactions:                        56272  (5624.21 per sec.)
    queries:                             56272  (5624.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0033s
    total number of events:              56272

Latency (ms):
         min:                                  0.40
         avg:                                  1.42
         max:                                130.11
         95th percentile:                      3.02
         sum:                              79888.17

Threads fairness:
    events (avg/stddev):           7034.0000/2076.30
    execution time (avg/stddev):   9.9860/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            43897
        write:                           0
        other:                           0
        total:                           43897
    transactions:                        43897  (4386.44 per sec.)
    queries:                             43897  (4386.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0056s
    total number of events:              43897

Latency (ms):
         min:                                  0.47
         avg:                                  3.64
         max:                                 47.74
         95th percentile:                      7.56
         sum:                             159829.06

Threads fairness:
    events (avg/stddev):           2743.5625/712.46
    execution time (avg/stddev):   9.9893/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            60835
        write:                           0
        other:                           0
        total:                           60835
    transactions:                        60835  (6076.69 per sec.)
    queries:                             60835  (6076.69 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0094s
    total number of events:              60835

Latency (ms):
         min:                                  0.43
         avg:                                  5.26
         max:                                107.35
         95th percentile:                      9.56
         sum:                             319932.71

Threads fairness:
    events (avg/stddev):           1901.0938/510.67
    execution time (avg/stddev):   9.9979/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            44836
        write:                           0
        other:                           0
        total:                           44836
    transactions:                        44836  (4473.23 per sec.)
    queries:                             44836  (4473.23 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0213s
    total number of events:              44836

Latency (ms):
         min:                                  0.49
         avg:                                 14.28
         max:                                318.39
         95th percentile:                     26.20
         sum:                             640339.01

Threads fairness:
    events (avg/stddev):           700.5625/185.54
    execution time (avg/stddev):   10.0053/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            56060
        write:                           0
        other:                           0
        total:                           56060
    transactions:                        56060  (5551.21 per sec.)
    queries:                             56060  (5551.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0967s
    total number of events:              56060

Latency (ms):
         min:                                  0.43
         avg:                                 22.86
         max:                               2201.88
         95th percentile:                     43.39
         sum:                            1281737.48

Threads fairness:
    events (avg/stddev):           437.9688/122.33
    execution time (avg/stddev):   10.0136/0.02

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            52676
        write:                           0
        other:                           0
        total:                           52676
    transactions:                        52676  (5216.77 per sec.)
    queries:                             52676  (5216.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0955s
    total number of events:              52676

Latency (ms):
         min:                                  0.55
         avg:                                 48.74
         max:                               4714.79
         95th percentile:                     89.16
         sum:                            2567666.54

Threads fairness:
    events (avg/stddev):           205.7656/57.22
    execution time (avg/stddev):   10.0299/0.02

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            58323
        write:                           0
        other:                           0
        total:                           58323
    transactions:                        58323  (5728.62 per sec.)
    queries:                             58323  (5728.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.1790s
    total number of events:              58323

Latency (ms):
         min:                                  0.45
         avg:                                 88.20
         max:                               7463.31
         95th percentile:                    170.48
         sum:                            5144313.42

Threads fairness:
    events (avg/stddev):           113.9121/32.83
    execution time (avg/stddev):   10.0475/0.04